src/Documents/Scan_ЗаказНаЗакупку/Scan_ЗаказНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗаказНаЗакупку</name>
  <basedOn>Document.Scan_ЗапросНаНадстройки</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НестандартныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦентрЗатрат</name>
    <type>
      <types>CatalogRef.Scan_ЦентрыЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_ЗапросНаНадстройки</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОНомерЗаказаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОДатаЗаказаНаЗакупку</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОСтатусЗаказаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДОПроцессСогласованияЗапущен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>BBНомерЗаказаНаЗакупку</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BBДатаОтправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BBДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПродуктыКЗаказу</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
    <attributes>
      <name>ПродуктЗапросаНаНадстройку</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаркаПродуктаЗапросаНаНадстройки</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.Scan_СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаЗавод</name>
      <type>
        <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераЗаказов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийДляПоставщика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийВнутренний</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_ЗапросНаНадстройки/Scan_ЗапросНаНадстройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗапросНаНадстройки</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеОПоставке</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереданВОтделПланированияПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыУслугиРаботы</name>
    <attributes>
      <name>ТоварУслуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаркаПродукта</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСпецификацииПоЦС</name>
      <comment>Номер спецификации по ценовому соглашению</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дилер</name>
      <type>
        <types>CatalogRef.Scan_Компании</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераЗаказовНаЗавод</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>НомераЗаказов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_ЗаказНаЗакупку/Forms/ФормаВводаНомеровЗаказов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НомераЗаказов") Тогда
		Для Каждого ЭлементНомераЗаказа Из Параметры.НомераЗаказов Цикл
			НоваяСтрока = НомераЗаказов.Добавить();
			НоваяСтрока.НомерЗаказа  = ЭлементНомераЗаказа.Значение;
			НоваяСтрока.ЗаказНаЗавод = Справочники.Scan_ЗаказыНаЗавод.НайтиПоНаименованию(ЭлементНомераЗаказа.Значение, Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Закрыть(ПоместитьНомераЗаказовНаСервере());
	
КонецПроцедуры

&НаСервере
Функция ПоместитьНомераЗаказовНаСервере()
	
	НомераЗаказовТаблицаЗначений = ДанныеФормыВЗначение(НомераЗаказов,Тип("ТаблицаЗначений"));
	
	Возврат ПоместитьВоВременноеХранилище(НомераЗаказовТаблицаЗначений.ВыгрузитьКолонку("НомерЗаказа"), Новый УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоДиапазону(Команда)
	
	Если ПустаяСтрока(ПервыйНомер) Тогда
		ПервыйНомерЧисло = 0;
	Иначе
		ПервыйНомерЧисло = Число(ПервыйНомер);
	КонецЕсли;
	
	Если ПустаяСтрока(ПоследнийНомер) Тогда
		ПоследнийНомерЧисло = 0;
	Иначе
		ПоследнийНомерЧисло = Число(ПоследнийНомер);
	КонецЕсли;
	
	Если     ПервыйНомерЧисло = 0
		Или  ПоследнийНомерЧисло = 0
		Или (ПоследнийНомерЧисло < ПервыйНомерЧисло)
		Тогда
		Сообщить(Нстр("ru = 'Необходимо указать корректный диапазон номеров!'; en = 'You must specify the correct range of numbers!'"));
		Возврат;
	КонецЕсли;
	
	Если ПоследнийНомерЧисло - ПервыйНомерЧисло > 100 Тогда
		Сообщить(Нстр("ru = 'Диапазон должен содержать не более 100 номеров!'; en = 'The range of numbers must contain no more than 100 numbers!'"));
		Возврат;
	КонецЕсли;
	
	Если НомераЗаказов.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоДиапазонуЗавершение", ЭтотОбъект),
		Нстр("ru = 'Очистить таблицу номеров заказов перед заполнением?'; en = 'Clear order number table before filling?'"), РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ЗаполнитьТаблицуНомеровЗаказовПоДиапазону();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДиапазонуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НомераЗаказов.Очистить();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуНомеровЗаказовПоДиапазону();
	
	Сообщить(Нстр("ru = 'Заполнение выполнено.'; en = 'Completed'"));
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНомеровЗаказовПоДиапазону()
	
	ПервыйНомерЧисло    = Число(ПервыйНомер);
	ПоследнийНомерЧисло = Число(ПоследнийНомер);
	
	Счетчик = ПервыйНомерЧисло;
	
	Пока Счетчик <= ПоследнийНомерЧисло Цикл
		СчетчикСтрокой = Строка(Формат(Счетчик,"ЧГ=0"));
		
		КолВоЗнаковЧисло = СтрДлина(СчетчикСтрокой);
		Для нПрефикса = 1 По (9 - КолВоЗнаковЧисло) Цикл
			СчетчикСтрокой = "0" + СчетчикСтрокой;
		КонецЦикла;
		
		ЗаказНаЗаводСсылка = ПолучитьЗаказНаЗавод(СчетчикСтрокой);
		
		Если ЗаказНаЗаводСсылка.Пустая() Тогда
			Счетчик = Счетчик + 1;
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = НомераЗаказов.НайтиСтроки(Новый Структура("ЗаказНаЗавод", ЗаказНаЗаводСсылка));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = НомераЗаказов.Добавить();
			НоваяСтрока.ЗаказНаЗавод = ЗаказНаЗаводСсылка;
			НоваяСтрока.НомерЗаказа  = СчетчикСтрокой; 
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗаказНаЗавод(НомерЗаказа)
	
	Возврат Справочники.Scan_ЗаказыНаЗавод.НайтиПоНаименованию(НомерЗаказа, Истина);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьИзБуфера(Команда)
	
	Если НомераЗаказов.Количество() > 0 Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьИзБуфераФрагмент", ЭтотОбъект),
		Нстр("ru = 'Очистить таблицу номеров заказов перед заполнением?'; en = 'Clear order number table before filling?'"), РежимДиалогаВопрос.ДаНетОтмена);
	Иначе
		ОткрытьФормуЗаполненияИзБуфера();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзБуфераФрагмент(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НомераЗаказов.Очистить();
	ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИзБуфераЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзБуфераЗавершение()
	
	ОткрытьФормуЗаполненияИзБуфера();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаполненияИзБуфера()
	
	Обработчик = Новый ОписаниеОповещения("ЗаполнитьТаблицуНомеровЗаказовИзБуфера", ЭтотОбъект);
	
	ПараметрыЗаполнения = Новый Структура;
	ОткрытьФорму("Документ.Scan_ЗапросНаНадстройки.Форма.ФормаИмпорта", ПараметрыЗаполнения, ЭтотОбъект,,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуНомеровЗаказовИзБуфера(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НомерИзБуфера Из РезультатЗакрытия Цикл
		НомерИзБуфераСтрокой = Строка(Формат(НомерИзБуфера,"ЧГ=0"));
		
		Попытка
			ЧислоСтроки = Число(НомерИзБуфераСтрокой);
			НомерЗаказаЧисло  = Истина;
		Исключение 
			НомерЗаказаЧисло  = Ложь;
		КонецПопытки;
		
		НомерЗаказа = НомерИзБуфераСтрокой;
		Если НомерЗаказаЧисло Тогда
			КолВоЗнаковЧисло = СтрДлина(НомерИзБуфераСтрокой);
			Для нПрефикса = 1 По (9 - КолВоЗнаковЧисло) Цикл
				НомерЗаказа = "0" + НомерЗаказа;
			КонецЦикла;
		КонецЕсли;
		
		ЗаказНаЗаводСсылка = ПолучитьЗаказНаЗавод(НомерЗаказа);
		
		Если ЗаказНаЗаводСсылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = НомераЗаказов.НайтиСтроки(Новый Структура("ЗаказНаЗавод", ЗаказНаЗаводСсылка));
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = НомераЗаказов.Добавить();
			НоваяСтрока.ЗаказНаЗавод = ЗаказНаЗаводСсылка;
			НоваяСтрока.НомерЗаказа  = НомерЗаказа;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура НомераЗаказовНомерЗаказаПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.НомераЗаказов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ЗаказНаЗавод) Тогда
		ДанныеСтроки.НомерЗаказа = СокрЛП(ДанныеСтроки.ЗаказНаЗавод);
	Иначе
		ДанныеСтроки.НомерЗаказа = "";
	КонецЕсли;
	
КонецПроцедуры
